spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_associated_with_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_1CFUPYIcRgydQIvRbiMMurAN
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.11.0
      Authorization:
      - Bearer sk_test_B3GmbKgT72FmPeG7QkvTvD8k
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.11.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin17.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Mactovi 17.5.0 Darwin Kernel Version 17.5.0: Mon Mar  5 22:24:32 PST 2018;
        root:xnu-4570.51.1~1/RELEASE_X86_64 x86_64","hostname":"Mactovi"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 11 Apr 2018 19:40:52 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2412'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8n9jd3dVDBuEL2
      Stripe-Version:
      - '2018-02-28'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_1CFUPYIcRgydQIvRbiMMurAN",
          "object": "event",
          "api_version": "2018-02-28",
          "created": 1523397236,
          "data": {
            "object": {
              "id": "ch_1CFUPXIcRgydQIvRu51ypDxp",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application": null,
              "application_fee": null,
              "balance_transaction": "txn_1CFUPXIcRgydQIvRoUH1nofk",
              "captured": true,
              "created": 1523397235,
              "currency": "usd",
              "customer": "cus_Ceo1FxosmdF621",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_1CFUPXIcRgydQIvRMg0Dv7tO",
              "livemode": false,
              "metadata": {},
              "on_behalf_of": null,
              "order": null,
              "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "seller_message": "Payment complete.",
                "type": "authorized"
              },
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_1CFUPXIcRgydQIvRu51ypDxp/refunds"
              },
              "review": null,
              "shipping": null,
              "source": {
                "id": "card_1CFUPWIcRgydQIvRc6eHNnyz",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "98112",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_Ceo1FxosmdF621",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2019,
                "fingerprint": "Hytx7AQsQDPpePyZ",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": "1 month of myflix",
              "status": "succeeded",
              "transfer_group": null
            }
          },
          "livemode": false,
          "pending_webhooks": 1,
          "request": {
            "id": "req_lbcavWsYy7ftPf",
            "idempotency_key": null
          },
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Wed, 11 Apr 2018 19:40:52 GMT
recorded_with: VCR 2.9.3
